# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Proposed Ultralytics RT-DETR DEIM XXL config on the native DINOv3 path.
# AP-first design:
# - backbone upgraded to DINOv3 ViT-B/16
# - wider hidden_dim/STA branch than XL
# - deeper neck blocks and 8-layer decoder
# - decoder FFN kept aggressive for initial accuracy-focused exploration
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # DEIMv2 DINOv3+STA backbone wrapper.
  # Parser args: [out_ch, name, pretrained, interaction_indexes, finetune, patch_size, use_sta, conv_inplane, hidden_dim, split]
  - [-1, 1, DEIMDINOv3STAs, [320, dinov3_vitb16, True, [5, 8, 11], True, 16, True, 96, 320, True]] # 0
  - [0, 1, Index, [320, 1]] # 1 P3
  - [0, 1, Index, [320, 2]] # 2 P4
  - [0, 1, Index, [320, 3]] # 3 P5

head:
  # Proposed XXL HybridEncoder head: input_proj + AIFI + FPN/PAN.
  # AP-first scaling over XL:
  # hidden_dim=320, dim_feedforward=1280, expansion=1.5, depth_mult~1.67.
  # That maps here to RepNCSPELAN5 args [c2=320, c3=640, c4=240, n=5].
  - [3, 1, nn.Identity, []] # 4 input_proj.2
  - [-1, 1, AIFI, [1280, 8]]
  - [-1, 1, Conv, [320, 1, 1, None, 1, 1, False]] # 6 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, nn.Identity, []] # 8 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [320, 640, 240, 5]] # 10 fpn_blocks.0
  - [-1, 1, Conv, [320, 1, 1, None, 1, 1, False]] # 11 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, nn.Identity, []] # 13 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [320, 640, 240, 5]] # 15 X3, fpn_blocks.1

  - [-1, 1, SCDown, [320, 3, 2, False]] # 16 downsample_convs.0
  - [[-1, 11], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [320, 640, 240, 5]] # 18 F4, pan_blocks.0

  - [-1, 1, SCDown, [320, 3, 2, False]] # 19 downsample_convs.1
  - [[-1, 6], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [320, 640, 240, 5]] # 21 F5, pan_blocks.1

  # DeimDecoder
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[15, 18, 21], 1, DeimDecoder, [nc, 320, 300, [3, 6, 3], 8, 8, 2560, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 40
