# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Proposed Ultralytics RT-DETR DEIM XXXL config on the native DINOv3 path.
# AP-first design:
# - backbone upgraded to official DINOv3 ViT-L/16
# - wider hidden_dim/STA branch than XXL
# - deeper neck blocks while keeping decoder depth at 8 for the first pass
# - decoder FFN remains aggressive for initial accuracy-focused exploration
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes

backbone:
  # [from, repeats, module, args]
  # DEIMv2 DINOv3+STA backbone wrapper.
  # Parser args: [out_ch, name, pretrained, interaction_indexes, finetune, patch_size, use_sta, conv_inplane, hidden_dim, split]
  - [-1, 1, DEIMDINOv3STAs, [384, dinov3_vitl16, True, [5, 8, 11], True, 16, True, 128, 384, True]] # 0
  - [0, 1, Index, [384, 1]] # 1 P3
  - [0, 1, Index, [384, 2]] # 2 P4
  - [0, 1, Index, [384, 3]] # 3 P5

head:
  # Proposed XXXL HybridEncoder head: input_proj + AIFI + FPN/PAN.
  # AP-first scaling over XXL:
  # hidden_dim=384, dim_feedforward=1536, expansion=1.5, depth_mult=2.0.
  # That maps here to RepNCSPELAN5 args [c2=384, c3=768, c4=288, n=6].
  - [3, 1, nn.Identity, []] # 4 input_proj.2
  - [-1, 1, AIFI, [1536, 8]]
  - [-1, 1, Conv, [384, 1, 1, None, 1, 1, False]] # 6 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, nn.Identity, []] # 8 input_proj.1
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [384, 768, 288, 6]] # 10 fpn_blocks.0
  - [-1, 1, Conv, [384, 1, 1, None, 1, 1, False]] # 11 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, nn.Identity, []] # 13 input_proj.0
  - [[-2, -1], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [384, 768, 288, 6]] # 15 X3, fpn_blocks.1

  - [-1, 1, SCDown, [384, 3, 2, False]] # 16 downsample_convs.0
  - [[-1, 11], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [384, 768, 288, 6]] # 18 F4, pan_blocks.0

  - [-1, 1, SCDown, [384, 3, 2, False]] # 19 downsample_convs.1
  - [[-1, 6], 1, Add, []]
  - [-1, 1, RepNCSPELAN5, [384, 768, 288, 6]] # 21 F5, pan_blocks.1

  # DeimDecoder
  # Args: [nc, hd, nq, ndp, nh, ndl, d_ffn, dropout, act, eval_idx, nd, label_noise_ratio, box_noise_scale,
  #        learnt_init_query, enable_cuda_acceleration, one_to_many_groups, dab_sine_embedding,
  #        efficient_msdeformable_attn, query_select_method, reg_max, reg_scale, layer_scale, mlp_act,
  #        o2m_topk_mode, use_gateway, share_bbox_head, share_score_head]
  - [[15, 18, 21], 1, DeimDecoder, [nc, 384, 300, [3, 6, 3], 8, 8, 3072, 0.0, "silu", -1, 100, 0.5, 1.0, False, False, 0, False, False, "default", 32, 4.0, 1.0, "silu", "unshared", True, False, False]]

loss:
  gamma: 1.5
  alpha: 0.75
  use_fl: False
  use_vfl: False
  use_mal: True
  use_union_set: True
  reg_max: 32
  loss_gain: {class: 1, bbox: 5, giou: 2, fgl: 0.15, ddf: 1.5}
  matcher:
    cost_gain: {class: 2, bbox: 5, giou: 2}
    use_fl: True
    alpha: 0.25
    gamma: 2.0
    change_matcher: True
    iou_order_alpha: 4.0
    matcher_change_epoch: 35
